tests/integration/bajaj/test_data/product_purchase_feed.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://local.bajaj.gladminds.co:8000/api/v1/feed/">
  <SOAP-ENV:Body>
    <ns1:postProductPurchase>
      <ns1:ObjectList>
        <ns1:ProductPurchaseData>
          <ns1:ProductPurchaseModel>
            <ns1:PIN_NO>560100</ns1:PIN_NO>
            <ns1:CUST_MOBILE>+919999999999</ns1:CUST_MOBILE>
            <ns1:VEH_SL_DLR>2014-11-25</ns1:VEH_SL_DLR>
            <ns1:KUNNR>GMDEALERNEW</ns1:KUNNR>
            <ns1:ENGINE>DSEWWE32</ns1:ENGINE>
            <ns1:CITY>Bagalore</ns1:CITY>
            <ns1:TIMESTAMP>2005-08-01000000</ns1:TIMESTAMP>
            <ns1:VEH_REG_NO>12345</ns1:VEH_REG_NO>
            <ns1:STATE>Karnataka</ns1:STATE>
            <ns1:CHASSIS>MD2A57BZ7EWB00027</ns1:CHASSIS>
            <ns1:VEH_SL_DT>2014-11-25</ns1:VEH_SL_DT>
            <ns1:CUSTOMER_ID>SAPCUSTOMER027</ns1:CUSTOMER_ID>
            <ns1:CUSTOMER_NAME>User name</ns1:CUSTOMER_NAME>
          </ns1:ProductPurchaseModel>
        </ns1:ProductPurchaseData>
      </ns1:ObjectList>
      <ns1:Credential>
        <ns1:UserName>bajaj</ns1:UserName>
        <ns1:Password>bajaj</ns1:Password>
      </ns1:Credential>
    </ns1:postProductPurchase>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>